; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	infrared5 - mode
	thermograph3 - mode
	spectrograph0 - mode
	thermograph4 - mode
	image2 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star2 - direction
	Star5 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared5)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 infrared5)
	(supports instrument4 thermograph4)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument8 infrared5)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 infrared5)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 Star5)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
	(supports instrument11 thermograph4)
	(supports instrument11 thermograph3)
	(supports instrument11 infrared5)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 GroundStation6)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star2)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Star7 thermograph1)
	(have_image Star7 thermograph3)
	(have_image Star8 thermograph3)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 thermograph1)
))

)

; plan
1. (turn_to satellite4 groundstation4 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 groundstation4)
   goals met: 1 of 8
2. (turn_to satellite3 groundstation0 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 groundstation0)
   goals met: 1 of 8
3. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite3 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite3 star7 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star7)
   goals met: 1 of 8
6. (take_image satellite3 star7 instrument5 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 2 of 8
7. (take_image satellite3 star7 instrument5 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 3 of 8
8. (turn_to satellite3 phenomenon10 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon10)
   goals met: 3 of 8
9. (take_image satellite3 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 8
10. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 4 of 8
11. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 4 of 8
12. (turn_to satellite3 phenomenon11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 8
13. (take_image satellite3 phenomenon11 instrument5 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 5 of 8
14. (turn_to satellite3 star8 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star8)
   goals met: 5 of 8
15. (take_image satellite3 star8 instrument5 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 6 of 8
16. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 6 of 8
17. (take_image satellite3 star9 instrument5 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 8
18. (turn_to satellite4 phenomenon10 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon10)
   goals met: 7 of 8
19. (take_image satellite4 phenomenon10 instrument10 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 8 of 8
